In [99]:
#import all libraries 
import pandas as pd
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [92]:
# load the Titanic dataset
data = sns.load_dataset('titanic')
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [93]:
# find missing data from dataset

data.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
sex              0
pclass           0
survived         0
fare             0
parch            0
sibsp            0
class            0
adult_male       0
who              0
alive            0
alone            0
dtype: int64

In [94]:
#chack the datatype of data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [95]:
# Missing Data can fill with mean, median, mode useing fillna() and Pandas

# data['deck'].fillna(data['deck'].mode()[0], inplace=True)

# or this for loop are fill all missing data even int and float types and also a categorical data type
for column in data.columns:
    if data[column].dtype == "category":
        data[column]=data[column].fillna(data[column].mode()[0])
    elif data[column].dtype == "int64" or data[column].dtype == "float64":
     data[column]=data[column].fillna(data[column].mean())

In [96]:
data.isnull().sum().sort_values(ascending=False)

embarked       2
embark_town    2
survived       0
age            0
sibsp          0
pclass         0
sex            0
fare           0
parch          0
who            0
class          0
adult_male     0
deck           0
alive          0
alone          0
dtype: int64

In [ ]:
#also you can remove the missing data by using the dropna() function
#df.dropna()

data = data.dropna()

# or if in columns in data are loat of missing data you can remove them by using the dropna()  
# or drop() the columns

#data['age'].dropna(axis=1)

In [102]:
data.isnull().sum().sort_values(ascending=False)

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64